robsanchez3/03_bootloader/Middlewares/ST/STM32_USB_Host_Library/Class/MSC/Src/usbh_msc_bot.c
/**
  ******************************************************************************
  * @file    usbh_msc_bot.c
  * @author  MCD Application Team
  * @brief   This file includes the BOT protocol related functions
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2015 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* BSPDependencies
- "stm32xxxxx_{eval}{discovery}{nucleo_144}.c"
- "stm32xxxxx_{eval}{discovery}_io.c"
- "stm32xxxxx_{eval}{discovery}{adafruit}_lcd.c"
- "stm32xxxxx_{eval}{discovery}_sdram.c"
EndBSPDependencies */

/* Includes ------------------------------------------------------------------*/
#include "usbh_msc_bot.h"
#include "usbh_msc.h"
#include "stm32u5xx_hal.h"   /* HAL_GetTick() */


/** @addtogroup USBH_LIB
  * @{
  */

/** @addtogroup USBH_CLASS
  * @{
  */

/** @addtogroup USBH_MSC_CLASS
  * @{
  */

/** @defgroup USBH_MSC_BOT
  * @brief    This file includes the mass storage related functions
  * @{
  */


/** @defgroup USBH_MSC_BOT_Private_TypesDefinitions
  * @{
  */
/**
  * @}
  */

/** @defgroup USBH_MSC_BOT_Private_Defines
  * @{
  */
/**
  * @}
  */

/** @defgroup USBH_MSC_BOT_Private_Macros
  * @{
  */
/**
  * @}
  */


/** @defgroup USBH_MSC_BOT_Private_Variables
  * @{
  */

/**
  * @}
  */


/** @defgroup USBH_MSC_BOT_Private_FunctionPrototypes
  * @{
  */
static USBH_StatusTypeDef USBH_MSC_BOT_Abort(USBH_HandleTypeDef *phost, uint8_t lun, uint8_t dir);
static BOT_CSWStatusTypeDef USBH_MSC_DecodeCSW(USBH_HandleTypeDef *phost);
/**
  * @}
  */


/** @defgroup USBH_MSC_BOT_Exported_Variables
  * @{
  */
/**
  * @}
  */


/** @defgroup USBH_MSC_BOT_Private_Functions
  * @{
  */

/**
  * @brief  USBH_MSC_BOT_REQ_Reset
  *         The function the MSC BOT Reset request.
  * @param  phost: Host handle
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_MSC_BOT_REQ_Reset(USBH_HandleTypeDef *phost)
{

  phost->Control.setup.b.bmRequestType = USB_H2D | USB_REQ_TYPE_CLASS
                                         | USB_REQ_RECIPIENT_INTERFACE;

  phost->Control.setup.b.bRequest = USB_REQ_BOT_RESET;
  phost->Control.setup.b.wValue.w = 0U;
  phost->Control.setup.b.wIndex.w = 0U;
  phost->Control.setup.b.wLength.w = 0U;

  return USBH_CtlReq(phost, NULL, 0U);
}

/**
  * @brief  USBH_MSC_BOT_REQ_GetMaxLUN
  *         The function the MSC BOT GetMaxLUN request.
  * @param  phost: Host handle
  * @param  Maxlun: pointer to Maxlun variable
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_MSC_BOT_REQ_GetMaxLUN(USBH_HandleTypeDef *phost, uint8_t *Maxlun)
{
  phost->Control.setup.b.bmRequestType = USB_D2H | USB_REQ_TYPE_CLASS
                                         | USB_REQ_RECIPIENT_INTERFACE;

  phost->Control.setup.b.bRequest = USB_REQ_GET_MAX_LUN;
  phost->Control.setup.b.wValue.w = 0U;
  phost->Control.setup.b.wIndex.w = 0U;
  phost->Control.setup.b.wLength.w = 1U;

  return USBH_CtlReq(phost, Maxlun, 1U);
}



/**
  * @brief  USBH_MSC_BOT_Init
  *         The function Initializes the BOT protocol.
  * @param  phost: Host handle
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_MSC_BOT_Init(USBH_HandleTypeDef *phost)
{

  MSC_HandleTypeDef *MSC_Handle = (MSC_HandleTypeDef *) phost->pActiveClass->pData;

  MSC_Handle->hbot.cbw.field.Signature = BOT_CBW_SIGNATURE;
  MSC_Handle->hbot.cbw.field.Tag = BOT_CBW_TAG;
  MSC_Handle->hbot.state = BOT_SEND_CBW;
  MSC_Handle->hbot.cmd_state = BOT_CMD_SEND;

  return USBH_OK;
}



/**
  * @brief  USBH_MSC_BOT_Process
  *         The function handle the BOT protocol.
  * @param  phost: Host handle
  * @param  lun: Logical Unit Number
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_MSC_BOT_Process(USBH_HandleTypeDef *phost, uint8_t lun)
{
  USBH_StatusTypeDef   status = USBH_BUSY;
  USBH_StatusTypeDef   error  = USBH_BUSY;
  BOT_CSWStatusTypeDef CSW_Status = BOT_CSW_CMD_FAILED;
  USBH_URBStateTypeDef URB_Status = USBH_URB_IDLE;
  MSC_HandleTypeDef *MSC_Handle = (MSC_HandleTypeDef *) phost->pActiveClass->pData;
  uint8_t toggle = 0U;
  static BOT_StateTypeDef last_bot_state = (BOT_StateTypeDef)0xFFU;

  if (MSC_Handle->hbot.state != last_bot_state)
  {
    last_bot_state = MSC_Handle->hbot.state;
    BOOT_USB_ST_TRACE("[BOT] state=%u", MSC_Handle->hbot.state);
  }

  switch (MSC_Handle->hbot.state)
  {
    case BOT_SEND_CBW:
      MSC_Handle->hbot.cbw.field.LUN = lun;
      MSC_Handle->hbot.state = BOT_SEND_CBW_WAIT;
      (void)USBH_BulkSendData(phost, MSC_Handle->hbot.cbw.data,
                              BOT_CBW_LENGTH, MSC_Handle->OutPipe, 1U);

      break;

    case BOT_SEND_CBW_WAIT:

      URB_Status = USBH_LL_GetURBState(phost, MSC_Handle->OutPipe);

      if (URB_Status == USBH_URB_DONE)
      {
        if (MSC_Handle->hbot.cbw.field.DataTransferLength != 0U)
        {
          /* If there is Data Transfer Stage */
          if (((MSC_Handle->hbot.cbw.field.Flags) & USB_REQ_DIR_MASK) == USB_D2H)
          {
            /* Data Direction is IN */
            MSC_Handle->hbot.state = BOT_DATA_IN;
          }
          else
          {
            /* Data Direction is OUT */
            MSC_Handle->hbot.state = BOT_DATA_OUT;
          }
        }
        else
        {
          /* If there is NO Data Transfer Stage */
          MSC_Handle->hbot.state = BOT_RECEIVE_CSW;
        }

#if (USBH_USE_OS == 1U)
        USBH_OS_PutMessage(phost, USBH_URB_EVENT, 0U, 0U);
#endif /* (USBH_USE_OS == 1U) */
      }
      else if (URB_Status == USBH_URB_NOTREADY)
      {
        /* Re-send CBW */
        MSC_Handle->hbot.state = BOT_SEND_CBW;

#if (USBH_USE_OS == 1U)
        USBH_OS_PutMessage(phost, USBH_URB_EVENT, 0U, 0U);
#endif /* (USBH_USE_OS == 1U) */
      }
      else if (URB_Status == USBH_URB_STALL)
      {
        MSC_Handle->hbot.state = BOT_ERROR_OUT;

#if (USBH_USE_OS == 1U)
        USBH_OS_PutMessage(phost, USBH_URB_EVENT, 0U, 0U);
#endif /* (USBH_USE_OS == 1U) */
      }
      else if ((URB_Status == USBH_URB_IDLE) || (URB_Status == USBH_URB_ERROR))
      {
        /* Re-send CBW on transient idle/error */
        MSC_Handle->hbot.state = BOT_SEND_CBW;
      }
      else
      {
      }
      break;

    case BOT_DATA_IN:

      /* Send first packet */
      (void)USBH_BulkReceiveData(phost, MSC_Handle->hbot.pbuf,
                                 MSC_Handle->InEpSize, MSC_Handle->InPipe);

#if defined (USBH_IN_NAK_PROCESS) && (USBH_IN_NAK_PROCESS == 1U)
      phost->NakTimer = phost->Timer;
#endif /* defined (USBH_IN_NAK_PROCESS) && (USBH_IN_NAK_PROCESS == 1U) */

      MSC_Handle->hbot.state = BOT_DATA_IN_WAIT;

      break;

    case BOT_DATA_IN_WAIT:
    {
      static uint32_t data_in_nodata_tick = 0U;
      uint32_t now_ms_di = HAL_GetTick();

      URB_Status = USBH_LL_GetURBState(phost, MSC_Handle->InPipe);

      if (URB_Status == USBH_URB_DONE)
      {
        /* Progress: reset the no-data watchdog. */
        data_in_nodata_tick = 0U;

        /* Adjust Data pointer and data length */
        if (MSC_Handle->hbot.cbw.field.DataTransferLength > MSC_Handle->InEpSize)
        {
          MSC_Handle->hbot.pbuf += MSC_Handle->InEpSize;
          MSC_Handle->hbot.cbw.field.DataTransferLength -= MSC_Handle->InEpSize;
        }
        else
        {
          MSC_Handle->hbot.cbw.field.DataTransferLength = 0U;
        }

        /* More Data To be Received */
        if (MSC_Handle->hbot.cbw.field.DataTransferLength > 0U)
        {
          /* Send next packet */
          (void)USBH_BulkReceiveData(phost, MSC_Handle->hbot.pbuf,
                                     MSC_Handle->InEpSize, MSC_Handle->InPipe);

#if defined (USBH_IN_NAK_PROCESS) && (USBH_IN_NAK_PROCESS == 1U)
           phost->NakTimer = phost->Timer;
#endif /* defined (USBH_IN_NAK_PROCESS) && (USBH_IN_NAK_PROCESS == 1U) */
        }
        else
        {
          /* If value was 0, and successful transfer, then change the state */
          MSC_Handle->hbot.state = BOT_RECEIVE_CSW;

#if (USBH_USE_OS == 1U)
          USBH_OS_PutMessage(phost, USBH_URB_EVENT, 0U, 0U);
#endif /* (USBH_USE_OS == 1U) */
        }
      }
#if defined (USBH_IN_NAK_PROCESS) && (USBH_IN_NAK_PROCESS == 1U)
      else if (URB_Status == USBH_URB_NAK_WAIT)
      {
        MSC_Handle->hbot.state = BOT_DATA_IN_WAIT;

        /* Use HAL_GetTick() (SysTick-based, always alive) instead of
         * phost->Timer (SOF-based).  If SOF interrupts stop firing,
         * phost->Timer freezes and the NakTimer condition never fires,
         * leaving the channel halted in NAK_WAIT forever. */
        {
          static uint32_t data_in_nak_tick = 0U;
          if ((now_ms_di - data_in_nak_tick) >= 3U)
          {
            data_in_nak_tick = now_ms_di;
            USBH_LL_ActivatePipe(phost, MSC_Handle->InPipe);
          }
        }

#if (USBH_USE_OS == 1U)
        USBH_OS_PutMessage(phost, USBH_URB_EVENT, 0U, 0U);
#endif /* (USBH_USE_OS == 1U) */
      }
#endif /* defined (USBH_IN_NAK_PROCESS) && (USBH_IN_NAK_PROCESS == 1U) */
      else if (URB_Status == USBH_URB_STALL)
      {
        /* This is Data IN Stage STALL Condition */
        data_in_nodata_tick = 0U;
        MSC_Handle->hbot.state  = BOT_ERROR_IN;

        /* Refer to USB Mass-Storage Class : BOT (www.usb.org)
        6.7.2 Host expects to receive data from the device
        3. On a STALL condition receiving data, then:
        The host shall accept the data received.
        The host shall clear the Bulk-In pipe.
        4. The host shall attempt to receive a CSW.*/

#if (USBH_USE_OS == 1U)
        USBH_OS_PutMessage(phost, USBH_URB_EVENT, 0U, 0U);
#endif /* (USBH_USE_OS == 1U) */
      }
      else if ((URB_Status == USBH_URB_IDLE) || (URB_Status == USBH_URB_ERROR))
      {
        if (phost->device.PortEnabled != 0U)
        {
          MSC_Handle->hbot.state = BOT_DATA_IN;
        }
      }
      else
      {
        /* URB_NOTREADY or unknown: device has stopped sending data.
         * Arm the watchdog on first occurrence, then after 5 s treat
         * this exactly like a STALL: Clear Feature the bulk-IN endpoint
         * so the next CBW starts from a clean channel state.           */
        if (data_in_nodata_tick == 0U)
        {
          data_in_nodata_tick = (now_ms_di != 0U) ? now_ms_di : 1U;
        }
        else if ((now_ms_di - data_in_nodata_tick) >= 5000U)
        {
          printf("[BOT] DATA_IN_WAIT timeout urb=%u -> BOT_ERROR_IN\n",
                 (unsigned int)URB_Status);
          data_in_nodata_tick = 0U;
          MSC_Handle->hbot.state = BOT_ERROR_IN;
        }
        else
        {
          /* Still within timeout window, keep waiting. */
        }
      }
    }
    break;

    case BOT_DATA_OUT:

      (void)USBH_BulkSendData(phost, MSC_Handle->hbot.pbuf,
                              MSC_Handle->OutEpSize, MSC_Handle->OutPipe, 1U);

      MSC_Handle->hbot.state  = BOT_DATA_OUT_WAIT;
      break;

    case BOT_DATA_OUT_WAIT:
      URB_Status = USBH_LL_GetURBState(phost, MSC_Handle->OutPipe);

      if (URB_Status == USBH_URB_DONE)
      {
        /* Adjust Data pointer and data length */
        if (MSC_Handle->hbot.cbw.field.DataTransferLength > MSC_Handle->OutEpSize)
        {
          MSC_Handle->hbot.pbuf += MSC_Handle->OutEpSize;
          MSC_Handle->hbot.cbw.field.DataTransferLength -= MSC_Handle->OutEpSize;
        }
        else
        {
          MSC_Handle->hbot.cbw.field.DataTransferLength = 0U;
        }

        /* More Data To be Sent */
        if (MSC_Handle->hbot.cbw.field.DataTransferLength > 0U)
        {
          (void)USBH_BulkSendData(phost, MSC_Handle->hbot.pbuf,
                                  MSC_Handle->OutEpSize, MSC_Handle->OutPipe, 1U);
        }
        else
        {
          /* If value was 0, and successful transfer, then change the state */
          MSC_Handle->hbot.state = BOT_RECEIVE_CSW;
        }

#if (USBH_USE_OS == 1U)
        USBH_OS_PutMessage(phost, USBH_URB_EVENT, 0U, 0U);
#endif /* (USBH_USE_OS == 1U) */
      }

      else if (URB_Status == USBH_URB_NOTREADY)
      {
        /* Resend same data */
        MSC_Handle->hbot.state = BOT_DATA_OUT;

#if (USBH_USE_OS == 1U)
        USBH_OS_PutMessage(phost, USBH_URB_EVENT, 0U, 0U);
#endif /* (USBH_USE_OS == 1U) */
      }

      else if (URB_Status == USBH_URB_STALL)
      {
        MSC_Handle->hbot.state = BOT_ERROR_OUT;

        /* Refer to USB Mass-Storage Class : BOT (www.usb.org)
        6.7.3 Ho - Host expects to send data to the device
        3. On a STALL condition sending data, then:
        " The host shall clear the Bulk-Out pipe.
        4. The host shall attempt to receive a CSW.
        */

#if (USBH_USE_OS == 1U)
        USBH_OS_PutMessage(phost, USBH_URB_EVENT, 0U, 0U);
#endif /* (USBH_USE_OS == 1U) */
      }
      else
      {
      }
      break;

    case BOT_RECEIVE_CSW:

      (void)USBH_BulkReceiveData(phost, MSC_Handle->hbot.csw.data,
                                 BOT_CSW_LENGTH, MSC_Handle->InPipe);

      MSC_Handle->hbot.state = BOT_RECEIVE_CSW_WAIT;

#if defined (USBH_IN_NAK_PROCESS) && (USBH_IN_NAK_PROCESS == 1U)
      phost->NakTimer = phost->Timer;
#endif /* defined (USBH_IN_NAK_PROCESS) && (USBH_IN_NAK_PROCESS == 1U) */
      break;

    case BOT_RECEIVE_CSW_WAIT:

      URB_Status = USBH_LL_GetURBState(phost, MSC_Handle->InPipe);

      /* Decode CSW */
      if (URB_Status == USBH_URB_DONE)
      {
        MSC_Handle->hbot.state = BOT_SEND_CBW;
        MSC_Handle->hbot.cmd_state = BOT_CMD_SEND;
        CSW_Status = USBH_MSC_DecodeCSW(phost);

        if (CSW_Status == BOT_CSW_CMD_PASSED)
        {
          status = USBH_OK;
        }
        else
        {
          status = USBH_FAIL;
        }

#if (USBH_USE_OS == 1U)
        USBH_OS_PutMessage(phost, USBH_URB_EVENT, 0U, 0U);
#endif /* (USBH_USE_OS == 1U) */
      }
#if defined (USBH_IN_NAK_PROCESS) && (USBH_IN_NAK_PROCESS == 1U)
      else if (URB_Status == USBH_URB_NAK_WAIT)
      {
        MSC_Handle->hbot.state = BOT_RECEIVE_CSW_WAIT;

        /* Same HAL_GetTick fix as BOT_DATA_IN_WAIT. */
        {
          static uint32_t csw_nak_tick = 0U;
          uint32_t now_ms = HAL_GetTick();
          if ((now_ms - csw_nak_tick) >= 3U)
          {
            csw_nak_tick = now_ms;
            USBH_LL_ActivatePipe(phost, MSC_Handle->InPipe);
          }
        }

#if (USBH_USE_OS == 1U)
        USBH_OS_PutMessage(phost, USBH_URB_EVENT, 0U, 0U);
#endif /* (USBH_USE_OS == 1U) */
      }
#endif /* defined (USBH_IN_NAK_PROCESS) && (USBH_IN_NAK_PROCESS == 1U) */
      else if (URB_Status == USBH_URB_STALL)
      {
        MSC_Handle->hbot.state = BOT_ERROR_IN;

#if (USBH_USE_OS == 1U)
        USBH_OS_PutMessage(phost, USBH_URB_EVENT, 0U, 0U);
#endif /* (USBH_USE_OS == 1U) */
      }
      else if ((URB_Status == USBH_URB_IDLE) || (URB_Status == USBH_URB_ERROR))
      {
        if (phost->device.PortEnabled != 0U)
        {
          MSC_Handle->hbot.state = BOT_RECEIVE_CSW;
        }
      }
      else
      {
      }
      break;

    case BOT_ERROR_IN:
    {
      static uint32_t error_in_tick = 0U;
      uint32_t now_ms = HAL_GetTick();

      if (error_in_tick == 0U)
      {
        error_in_tick = (now_ms != 0U) ? now_ms : 1U;
        printf("[BOT] BOT_ERROR_IN entered lun=%u\n", (unsigned int)lun);
      }

      /* Diagnostics every 500 ms */
      {
        static uint32_t error_in_diag_tick = 0U;
        if ((now_ms - error_in_diag_tick) >= 500U)
        {
          error_in_diag_tick = now_ms;
          HCD_HandleTypeDef *hhcd = (HCD_HandleTypeDef *)phost->pData;
          uint8_t p = phost->Control.pipe_in;
          printf("[BOT] BOT_ERROR_IN ctrl=%u req=%u hc=%u urb=%u nak=%u\n",
                 (unsigned int)phost->Control.state,
                 (unsigned int)phost->RequestState,
                 (unsigned int)hhcd->hc[p].state,
                 (unsigned int)hhcd->hc[p].urb_state,
                 (unsigned int)hhcd->hc[p].NakCnt);
        }
      }

      /* 2-second timeout: Clear Feature is stuck, abandon and do BOT Reset */
      if ((now_ms - error_in_tick) >= 2000U)
      {
        error_in_tick = 0U;
        printf("[BOT] BOT_ERROR_IN timeout -> BOT_UNRECOVERED_ERROR\n");
        /* Abort the stuck control transfer so it can restart cleanly */
        phost->RequestState  = CMD_SEND;
        phost->Control.state = CTRL_IDLE;
        MSC_Handle->hbot.state = BOT_UNRECOVERED_ERROR;
        break;
      }

      error = USBH_MSC_BOT_Abort(phost, lun, BOT_DIR_IN);

      if (error == USBH_OK)
      {
        error_in_tick = 0U;
        MSC_Handle->hbot.state = BOT_RECEIVE_CSW;
      }
      else if ((error == USBH_UNRECOVERED_ERROR) ||
               (error == USBH_FAIL)              ||
               (error == USBH_NOT_SUPPORTED))
      {
        error_in_tick = 0U;
        MSC_Handle->hbot.state = BOT_UNRECOVERED_ERROR;
      }
      else
      {
        /* USBH_BUSY: keep waiting */
      }
    }
    break;

    case BOT_ERROR_OUT:
      error = USBH_MSC_BOT_Abort(phost, lun, BOT_DIR_OUT);

      if (error == USBH_OK)
      {
        toggle = USBH_LL_GetToggle(phost, MSC_Handle->OutPipe);
        (void)USBH_LL_SetToggle(phost, MSC_Handle->OutPipe, 1U - toggle);
        (void)USBH_LL_SetToggle(phost, MSC_Handle->InPipe, 0U);
        MSC_Handle->hbot.state = BOT_ERROR_IN;
      }
      else
      {
        if (error == USBH_UNRECOVERED_ERROR)
        {
          MSC_Handle->hbot.state = BOT_UNRECOVERED_ERROR;
        }
      }
      break;


    case BOT_UNRECOVERED_ERROR:
    {
      static uint32_t unrec_tick = 0U;
      uint32_t now_ms_u = HAL_GetTick();

      if (unrec_tick == 0U)
      {
        unrec_tick = (now_ms_u != 0U) ? now_ms_u : 1U;
        printf("[BOT] BOT_UNRECOVERED_ERROR entered\n");
      }

      /* 2-second timeout: BOT Reset control transfer is also stuck */
      if ((now_ms_u - unrec_tick) >= 2000U)
      {
        unrec_tick = 0U;
        printf("[BOT] BOT_UNRECOVERED_ERROR timeout -> FAIL\n");
        phost->RequestState  = CMD_SEND;
        phost->Control.state = CTRL_IDLE;
        status = USBH_UNRECOVERED_ERROR;
        break;
      }

      status = USBH_MSC_BOT_REQ_Reset(phost);
      if (status == USBH_OK)
      {
        unrec_tick = 0U;
        MSC_Handle->hbot.state = BOT_SEND_CBW;
        /* Return BUSY so the caller keeps driving the state machine
         * for the retry CBW, rather than falsely signalling success. */
        status = USBH_BUSY;
      }
      else if (status == USBH_FAIL)
      {
        unrec_tick = 0U;
        MSC_Handle->hbot.state = BOT_SEND_CBW;
        status = USBH_UNRECOVERED_ERROR;
      }
    }
    break;

    default:
      break;
  }
  return status;
}

/**
  * @brief  USBH_MSC_BOT_Abort
  *         The function handle the BOT Abort process.
  * @param  phost: Host handle
  * @param  lun: Logical Unit Number
  * @param  dir: direction (0: out / 1 : in)
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_MSC_BOT_Abort(USBH_HandleTypeDef *phost, uint8_t lun, uint8_t dir)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(lun);

  USBH_StatusTypeDef status = USBH_FAIL;
  MSC_HandleTypeDef *MSC_Handle = (MSC_HandleTypeDef *) phost->pActiveClass->pData;

  switch (dir)
  {
    case BOT_DIR_IN :
      /* send ClrFeture on Bulk IN endpoint */
      status = USBH_ClrFeature(phost, MSC_Handle->InEp);

      break;

    case BOT_DIR_OUT :
      /*send ClrFeature on Bulk OUT endpoint */
      status = USBH_ClrFeature(phost, MSC_Handle->OutEp);
      break;

    default:
      break;
  }
  return status;
}

/**
  * @brief  USBH_MSC_BOT_DecodeCSW
  *         This function decodes the CSW received by the device and updates the
  *         same to upper layer.
  * @param  phost: Host handle
  * @retval USBH Status
  * @notes
  *     Refer to USB Mass-Storage Class : BOT (www.usb.org)
  *    6.3.1 Valid CSW Conditions :
  *     The host shall consider the CSW valid when:
  *     1. dCSWSignature is equal to 53425355h
  *     2. the CSW is 13 (Dh) bytes in length,
  *     3. dCSWTag matches the dCBWTag from the corresponding CBW.
  */

static BOT_CSWStatusTypeDef USBH_MSC_DecodeCSW(USBH_HandleTypeDef *phost)
{
  MSC_HandleTypeDef *MSC_Handle = (MSC_HandleTypeDef *) phost->pActiveClass->pData;
  BOT_CSWStatusTypeDef status = BOT_CSW_CMD_FAILED;

  /*Checking if the transfer length is different than 13*/
  if (USBH_LL_GetLastXferSize(phost, MSC_Handle->InPipe) != BOT_CSW_LENGTH)
  {
    /*(4) Hi > Dn (Host expects to receive data from the device,
    Device intends to transfer no data)
    (5) Hi > Di (Host expects to receive data from the device,
    Device intends to send data to the host)
    (9) Ho > Dn (Host expects to send data to the device,
    Device intends to transfer no data)
    (11) Ho > Do  (Host expects to send data to the device,
    Device intends to receive data from the host)*/

    status = BOT_CSW_PHASE_ERROR;
  }
  else
  {
    /* CSW length is Correct */

    /* Check validity of the CSW Signature and CSWStatus */
    if (MSC_Handle->hbot.csw.field.Signature == BOT_CSW_SIGNATURE)
    {
      /* Check Condition 1. dCSWSignature is equal to 53425355h */

      if (MSC_Handle->hbot.csw.field.Tag == MSC_Handle->hbot.cbw.field.Tag)
      {
        /* Check Condition 3. dCSWTag matches the dCBWTag from the
        corresponding CBW */

        if (MSC_Handle->hbot.csw.field.Status == 0U)
        {
          status = BOT_CSW_CMD_PASSED;
        }
        else if (MSC_Handle->hbot.csw.field.Status == 1U)
        {
          status = BOT_CSW_CMD_FAILED;
        }
        else if (MSC_Handle->hbot.csw.field.Status == 2U)
        {
          status = BOT_CSW_PHASE_ERROR;
        }
        else
        {
        }
      } /* CSW Tag Matching is Checked  */
    } /* CSW Signature Correct Checking */
    else
    {
      /* If the CSW Signature is not valid, We sall return the Phase Error to
      Upper Layers for Reset Recovery */

      status = BOT_CSW_PHASE_ERROR;
    }
  } /* CSW Length Check*/

  return status;
}


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
